app/controllers/bootlegs_controller.rb

  def index
    @bootlegs = Bootleg.all
---
SELECT * FROM "bootlegs"

  def edit
    @bootleg = Bootleg.find(params[:id])
---
SELECT * FROM "bootlegs" WHERE ("bootlegs"."id" = 1)

  def show
    @bootleg = Bootleg.find(params[:id])
---
SELECT * FROM "bootlegs" WHERE ("bootlegs"."id" = 1)