app/controllers/home_controller.rb

  def index
    @homes = Page.all
---
SELECT * FROM "pages"