app/controllers/pages_controller.rb

SELECT * FROM "pages"
---
  def index
    @pages = Page.all

SELECT * FROM "pages" WHERE ("pages"."permalink" = 'about') LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      @page.revert_to(params[:version].to_i) if params[:version]
      raise ActiveRecord::RecordNotFound, "Page not found" if @page.nil?
    else
      @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "permalink", "updated_at", "content", "created_at") VALUES('About', 'about', '2010-02-02 13:32:54', 'Lots of info about this site!
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save