app/controllers/performances_controller.rb

  def index
    #@performances = Performance.paginate :page => params[:page], :order => 'date DESC'
    @performances = Performance.search(params[:search], :page => params[:page], :per_page => 25, :order => "date DESC")
---
SELECT * FROM "performances"

  def show
    @performance = Performance.find_by_permalink!(params[:id])
    @performance.revert_to(params[:version].to_i) if params[:version]
    @attendees = @performance.users
    add_crumb @performance.compact_with_band, @performance

    if @performance.modified_order?
      @played = PlayedSong.find(:all, :conditions => {:performance_id => @performance}, :order => "play_order ASC")
---
SELECT * FROM "performances" WHERE ("performances"."permalink" = '2010-02-15-the-wiltern-los-angeles-ca') LIMIT 1
SELECT * FROM "bands" WHERE ("bands"."id" = 1)
SELECT * FROM "played_songs" WHERE ("played_songs"."performance_id" = 21) ORDER BY play_order ASC
SELECT * FROM "songs" WHERE ("songs"."id" = 1) ORDER BY 1
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def edit
    @performance = Performance.find_by_permalink!(params[:id])
---
SELECT * FROM "performances" WHERE ("performances"."permalink" = '2010-02-15-the-wiltern-los-angeles-ca') LIMIT 1

  def update
    @performance = Performance.find_by_permalink!(params[:id])
---
SELECT "performances".id FROM "performances" WHERE ("performances"."permalink" = '2010-02-15-the-wiltern-los-angeles-ca' AND "performances".id <> 21) LIMIT 1