app/controllers/played_songs_controller.rb

  def index
    @played_songs = PlayedSong.all
---
SELECT * FROM "played_songs"