app/controllers/songs_controller.rb

SELECT * FROM "songs" WHERE ("songs"."permalink" = 'burn') LIMIT 1
---
  def show
    @song = Song.find_by_permalink(params[:id])