app/controllers/tours_controller.rb

SELECT * FROM "tours" WHERE ("tours"."permalink" = 'wave-goodbye') LIMIT 1
SELECT * FROM "performances" WHERE ("performances".tour_id = 1)
---
  def show
    # @tour = Tour.find(params[:id])
    @tour = Tour.find_by_permalink(params[:id])
    @performances = Performance.find(:all, :conditions => {:tour_id => @tour.id}, :order => 'date DESC')