app/controllers/users_controller.rb

INSERT INTO "users" ("occupation", "photo_file_name", "photo_file_size", "updated_at", "crypted_password", "password_salt", "photo_updated_at", "admin", "website", "given_name", "about", "photo_content_type", "persistence_token", "bootleg_id", "login", "address", "interests", "email", "created_at") VALUES(NULL, NULL, NULL, '2010-02-02 02:10:36', '8b4d70c874f4e7f246f6d40b643fafca8ceceba2e24fd43671719d3ae15d8f346fcae17e3f72199a9bc6789482158473b02ff5a660833b22136d6da856ca99ed', '2nG7w5dLr3gRSgIOeBQD', NULL, NULL, NULL, NULL, NULL, NULL, '95ba88c42e3b3178eb40eb9d4760f6ed5fd1d3597ee5ed1355e4a40a20550b90be60f8579a197e9c110fc6aa3dd5d9b10028c41e205eb228d87482d36f83f091', NULL, 'kyle', NULL, NULL, 'superklye@gmail.com', '2010-02-02 02:10:36')
---
  def create
    @user = User.new(params[:user])

    if @user.save